// library.js - Здесь хранятся все списки документов по блокам
const blocksData = {
    1: [
        { name: "Руководство S7-400", file: "pdfs/blok-1/S7-400_instalation.pdf" }
        // Сюда будешь добавлять новые файлы через запятую:
        // { name: "Название", file: "путь/к/файлу.pdf" }
    ],
    2: [],
    3: [],
    4: [],
    5: [],
    6: [],
    other: [
        // Пример для общих инструкций
        // { name: "Техника безопасности", file: "pdfs/common/safety.pdf" }
    ],
    zip: [
        // Пример для ЗИП
        // { name: "Перечень ЗИП 2026", file: "pdfs/zip/list.pdf" }
    ]
};